In [1]:
import numpy as np
import pandas as pd

- Numpy ==> Array ==> Vector --> Matrix
- Pandas ===> Series - DataFrame

In [2]:
## Series ==> Array yg memiliki Nama

## Series

In [3]:
x = [80, 13, 79, 100, 86, 51, 98]
y = np.array(x)
z = pd.Series(y) ## Series dari Array

In [4]:
z

0     80
1     13
2     79
3    100
4     86
5     51
6     98
dtype: int32

In [5]:
z1 = pd.Series(x)
z1

0     80
1     13
2     79
3    100
4     86
5     51
6     98
dtype: int64

In [6]:
z[3]

100

In [7]:
z1[4]

86

In [8]:
ind = ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [9]:
z2 = pd.Series(data=y, index=ind)
z2

A     80
B     13
C     79
D    100
E     86
F     51
G     98
dtype: int32

In [10]:
z2[3]

100

In [11]:
z2['D']

100

In [12]:
z2[2]

79

In [13]:
z2['C']

79

In [14]:
z3 = pd.Series(data=y, index=ind, name='Latihan')

In [15]:
z3

A     80
B     13
C     79
D    100
E     86
F     51
G     98
Name: Latihan, dtype: int32

In [16]:
z3['G']

98

In [17]:
x1 = {
'a' : 150,
'b' : 200,
'c' : 450,
'd' : 600}
z5 = pd.Series(x1)

In [18]:
z5

a    150
b    200
c    450
d    600
dtype: int64

In [19]:
z5['c']

450

## DataFrame

In [20]:
val = [75, 600, 80, 700, 91]

In [21]:
s = pd.Series(val, name='IniSeries')
s

0     75
1    600
2     80
3    700
4     91
Name: IniSeries, dtype: int64

In [22]:
d = pd.DataFrame(val, columns=['IniDataFrame'])
d

   IniDataFrame
0            75
1           600
2            80
3           700
4            91

In [23]:
d['IniDataFrame']

0     75
1    600
2     80
3    700
4     91
Name: IniDataFrame, dtype: int64

In [24]:
## Ketika menggunakan parameter Index atau Columns, isinya harus menggunakan LIST meskipun hanya 1 dan Jumlahnya harus sesuai dg Datanya

In [25]:
x2 = np.array([
    [2, 80],
    [7, 83],
    [5, 90],
    [8, 94]
])

In [26]:
s2 = pd.Series(x2)  ## Series hanya dapat digunakan untuk data 1 dimensi
s2

ValueError: Data must be 1-dimensional, got ndarray of shape (4, 2) instead

In [27]:
d2 = pd.DataFrame(data=x2, columns =['id', 'nilai'])
d2

   id  nilai
0   2     80
1   7     83
2   5     90
3   8     94

In [144]:
data = [
['Ari', 25, 'Bandung'],
['Andi', 24, 'Jakarta'],
['Mike', 22, 'Surabaya'],
['Cindy', 20, 'Jakarta']]

In [145]:
df2 = pd.DataFrame(data, columns=['Nama Siswa', 'Usia', 'Kota'],
                  index = ['A', 'B', 'C', 'D'])
df2

  Nama Siswa  Usia      Kota
A        Ari    25   Bandung
B       Andi    24   Jakarta
C       Mike    22  Surabaya
D      Cindy    20   Jakarta

In [30]:
df.T

                  A        B         C        D
Nama Siswa      Ari     Andi      Mike    Cindy
Usia             25       24        22       20
Kota        Bandung  Jakarta  Surabaya  Jakarta

In [31]:
df

  Nama Siswa  Usia      Kota
A        Ari    25   Bandung
B       Andi    24   Jakarta
C       Mike    22  Surabaya
D      Cindy    20   Jakarta

In [32]:
df['Nama Siswa']

A      Ari
B     Andi
C     Mike
D    Cindy
Name: Nama Siswa, dtype: object

In [33]:
df['Usia']

A    25
B    24
C    22
D    20
Name: Usia, dtype: int64

In [34]:
type(df['Usia'])

pandas.core.series.Series

In [35]:
df.Usia

A    25
B    24
C    22
D    20
Name: Usia, dtype: int64

In [36]:
df.Kota

A     Bandung
B     Jakarta
C    Surabaya
D     Jakarta
Name: Kota, dtype: object

In [37]:
df['Nama Siswa']

A      Ari
B     Andi
C     Mike
D    Cindy
Name: Nama Siswa, dtype: object

In [38]:
type(df['Nama Siswa'])

pandas.core.series.Series

In [39]:
df[['Nama Siswa']]

  Nama Siswa
A        Ari
B       Andi
C       Mike
D      Cindy

In [40]:
type(df[['Nama Siswa']])

pandas.core.frame.DataFrame

In [41]:
data = np.random.randn(5, 4)
data

array([[ 1.04900235,  0.67922904,  1.1843248 ,  0.54406961],
       [-0.83389664, -1.35881577, -0.7082775 , -0.34970672],
       [-1.09776282, -0.82004584,  0.29685628,  0.07782096],
       [-0.76591311,  0.03929256, -2.00233702,  0.44268963],
       [-0.88100967, -0.61004947, -1.1402043 , -0.44405185]])

In [42]:
col = 'W X Y Z'.split(' ')
col

['W', 'X', 'Y', 'Z']

In [43]:
df = pd.DataFrame(data, columns = col, index = 'A B C D E'.split(' '))
df

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821
D -0.765913  0.039293 -2.002337  0.442690
E -0.881010 -0.610049 -1.140204 -0.444052

In [44]:
df.X

A    0.679229
B   -1.358816
C   -0.820046
D    0.039293
E   -0.610049
Name: X, dtype: float64

In [45]:
df['Y']

A    1.184325
B   -0.708278
C    0.296856
D   -2.002337
E   -1.140204
Name: Y, dtype: float64

In [46]:
df[['Z']]

          Z
A  0.544070
B -0.349707
C  0.077821
D  0.442690
E -0.444052

In [47]:
df[['Z', 'W']]

          Z         W
A  0.544070  1.049002
B -0.349707 -0.833897
C  0.077821 -1.097763
D  0.442690 -0.765913
E -0.444052 -0.881010

In [48]:
df[['Z', 'W', 'Y']]

          Z         W         Y
A  0.544070  1.049002  1.184325
B -0.349707 -0.833897 -0.708278
C  0.077821 -1.097763  0.296856
D  0.442690 -0.765913 -2.002337
E -0.444052 -0.881010 -1.140204

In [49]:
df['Z']

A    0.544070
B   -0.349707
C    0.077821
D    0.442690
E   -0.444052
Name: Z, dtype: float64

In [50]:
df['Z']['C']

0.07782095588200688

In [51]:
df['Z'][2]

0.07782095588200688

In [52]:
df['Z']

A    0.544070
B   -0.349707
C    0.077821
D    0.442690
E   -0.444052
Name: Z, dtype: float64

In [53]:
df['Z'][['C', 'E']]

C    0.077821
E   -0.444052
Name: Z, dtype: float64

In [54]:
df['Z'][:3]

A    0.544070
B   -0.349707
C    0.077821
Name: Z, dtype: float64

In [55]:
df['Z']['A':'C']

A    0.544070
B   -0.349707
C    0.077821
Name: Z, dtype: float64

In [56]:
df['Z']['A':'C']

A    0.544070
B   -0.349707
C    0.077821
Name: Z, dtype: float64

In [57]:
df[['Z']][:3]

          Z
A  0.544070
B -0.349707
C  0.077821

In [58]:
df[['Z']]['A':'C']

          Z
A  0.544070
B -0.349707
C  0.077821

In [59]:
df['Z']

A    0.544070
B   -0.349707
C    0.077821
D    0.442690
E   -0.444052
Name: Z, dtype: float64

In [60]:
df['Z']['B']

-0.3497067225254126

In [61]:
df[['Z']]

          Z
A  0.544070
B -0.349707
C  0.077821
D  0.442690
E -0.444052

In [62]:
df[['Z']]['B']

KeyError: 'B'

In [63]:
df['X']

A    0.679229
B   -1.358816
C   -0.820046
D    0.039293
E   -0.610049
Name: X, dtype: float64

In [64]:
df.loc['C']

W   -1.097763
X   -0.820046
Y    0.296856
Z    0.077821
Name: C, dtype: float64

In [65]:
df.loc[['C']]

          W         X         Y         Z
C -1.097763 -0.820046  0.296856  0.077821

In [66]:
df[['X']]

          X
A  0.679229
B -1.358816
C -0.820046
D  0.039293
E -0.610049

In [67]:
df[['Z']].loc['B']

Z   -0.349707
Name: B, dtype: float64

In [68]:
df[['Z']]

          Z
A  0.544070
B -0.349707
C  0.077821
D  0.442690
E -0.444052

In [69]:
df[['Z']].loc[['B', 'C', 'D']]

          Z
B -0.349707
C  0.077821
D  0.442690

In [70]:
df.loc[['B', 'C', 'E']]

          W         X         Y         Z
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821
E -0.881010 -0.610049 -1.140204 -0.444052

In [71]:
df[['Z']]

          Z
A  0.544070
B -0.349707
C  0.077821
D  0.442690
E -0.444052

In [72]:
df[['Z']].iloc[3]

Z    0.44269
Name: D, dtype: float64

In [73]:
df

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821
D -0.765913  0.039293 -2.002337  0.442690
E -0.881010 -0.610049 -1.140204 -0.444052

In [74]:
df[['W', 'Z']]

          W         Z
A  1.049002  0.544070
B -0.833897 -0.349707
C -1.097763  0.077821
D -0.765913  0.442690
E -0.881010 -0.444052

In [75]:
df[:3]

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821

In [76]:
df['A' : 'D']

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821
D -0.765913  0.039293 -2.002337  0.442690

In [77]:
df['W': 'Y']

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [78]:
df[['W', 'Y']]

          W         Y
A  1.049002  1.184325
B -0.833897 -0.708278
C -1.097763  0.296856
D -0.765913 -2.002337
E -0.881010 -1.140204

In [79]:
df.loc['C']

W   -1.097763
X   -0.820046
Y    0.296856
Z    0.077821
Name: C, dtype: float64

In [80]:
df.loc[['C']]

          W         X         Y         Z
C -1.097763 -0.820046  0.296856  0.077821

In [81]:
df.loc[['A', 'D', 'E']]

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
D -0.765913  0.039293 -2.002337  0.442690
E -0.881010 -0.610049 -1.140204 -0.444052

In [82]:
df.loc['A':'E':2]

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
C -1.097763 -0.820046  0.296856  0.077821
E -0.881010 -0.610049 -1.140204 -0.444052

In [83]:
df[['W', 'Z']].loc['C']

W   -1.097763
Z    0.077821
Name: C, dtype: float64

In [84]:
df['W'][['D', 'E']]

D   -0.765913
E   -0.881010
Name: W, dtype: float64

In [85]:
df

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821
D -0.765913  0.039293 -2.002337  0.442690
E -0.881010 -0.610049 -1.140204 -0.444052

In [88]:
df[['W']].loc[['A', 'D']]

          W
A  1.049002
D -0.765913

In [90]:
df[['W']].loc['C']

W   -1.097763
Name: C, dtype: float64

In [92]:
df.iloc[[3]]

          W         X         Y        Z
D -0.765913  0.039293 -2.002337  0.44269

In [93]:
df[2] ## Jika angka hanya 1, maka akan dianggap sebagai Nama KOLOM

KeyError: 2

In [94]:
df[:2] ## Tetapi ketika kita menggunakan format subsetting-slicing, maka ini mengakses BARIS, berlaku Inclusive dan Exclusive (Jika menggunakan Index)

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
B -0.833897 -1.358816 -0.708278 -0.349707

In [96]:
df['A' : 'C'] ## Ketika menggunakan Label dari Baris, melakukan Slicing tanpa mengenal Exclusive

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821

In [97]:
df.loc[['A', 'D', 'C']]

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
D -0.765913  0.039293 -2.002337  0.442690
C -1.097763 -0.820046  0.296856  0.077821

In [98]:
df.loc['A' : 'E' : 2]

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
C -1.097763 -0.820046  0.296856  0.077821
E -0.881010 -0.610049 -1.140204 -0.444052

In [100]:
df[['W', 'X']].loc[['D', 'C', 'E']]

          W         X
D -0.765913  0.039293
C -1.097763 -0.820046
E -0.881010 -0.610049

In [101]:
df

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821
D -0.765913  0.039293 -2.002337  0.442690
E -0.881010 -0.610049 -1.140204 -0.444052

In [102]:
df.loc['A']

W    1.049002
X    0.679229
Y    1.184325
Z    0.544070
Name: A, dtype: float64

In [103]:
df.iloc[0]

W    1.049002
X    0.679229
Y    1.184325
Z    0.544070
Name: A, dtype: float64

In [104]:
df.loc[['A']]

          W         X         Y        Z
A  1.049002  0.679229  1.184325  0.54407

In [106]:
df.iloc[[0]]

          W         X         Y        Z
A  1.049002  0.679229  1.184325  0.54407

In [108]:
df.loc[['A']][['X', 'Y']]

          X         Y
A  0.679229  1.184325

In [111]:
df.loc['C']['Y']

0.296856284552912

In [115]:
df.loc['C']

W   -1.097763
X   -0.820046
Y    0.296856
Z    0.077821
Name: C, dtype: float64

In [112]:
df.loc['C', 'Y'] ### Ketika menggunakan .loc dan 1 bracket serta datanya sebelum dan sesudah KOMA hanya 1, kemudian di dalam nya ada KOMA, maka Sebelum KOMA merupakan Keterangan BARIS, setelah KOMA merupakan keterangan KOLOM

0.296856284552912

In [113]:
df.loc[['C', 'E']] ## DUa-dua nya mengakses BARIS

          W         X         Y         Z
C -1.097763 -0.820046  0.296856  0.077821
E -0.881010 -0.610049 -1.140204 -0.444052

In [114]:
df.loc[['C', 'E']]['Z']

C    0.077821
E   -0.444052
Name: Z, dtype: float64

In [116]:
df.loc[['C', 'E'], 'Z']

C    0.077821
E   -0.444052
Name: Z, dtype: float64

In [117]:
df.loc[['C', 'E'], ['Z', 'X']]

          Z         X
C  0.077821 -0.820046
E -0.444052 -0.610049

In [119]:
df[['Z', 'X']].loc[['C', 'E']]

          Z         X
C  0.077821 -0.820046
E -0.444052 -0.610049

In [120]:
df

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821
D -0.765913  0.039293 -2.002337  0.442690
E -0.881010 -0.610049 -1.140204 -0.444052

In [121]:
df.iloc[1]

W   -0.833897
X   -1.358816
Y   -0.708278
Z   -0.349707
Name: B, dtype: float64

In [122]:
df.iloc[1]['Y']

-0.7082775004598489

In [124]:
df.iloc[1, 2]

-0.7082775004598489

In [123]:
df.iloc[1, 'Y'] ## Ketika menggunakan iLoc dan dalam 1 bracket, baik BARIS maupun KOLOM harus menggunakan INDEX

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [127]:
df.iloc[1, 2] ## Mengakses Baris INDEX 1 (B), dan KOLOM INDEX 2 (Y)

-0.7082775004598489

In [129]:
df.iloc[[1, 2]] ## Mengakses BARIS INDEX 1 (B) dan INDEX 2 (C)

          W         X         Y         Z
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821

In [135]:
df[['X', 'Y']].iloc[[1, 2]]

          X         Y
B -1.358816 -0.708278
C -0.820046  0.296856

In [130]:
df.iloc[[1, 2]][['X', 'Y']]

          X         Y
B -1.358816 -0.708278
C -0.820046  0.296856

In [131]:
df.iloc[[1, 2], ['X', 'Y']] ## AKAN ERROR, Format AKSES KOLOM harus menggunakan INDEX

IndexError: .iloc requires numeric indexers, got ['X' 'Y']

In [133]:
df.iloc[[1, 2], [1, 2]] ## akan mengakses BARIS INDEX 1 (B) dan INDEX 2 (C) kemudian akses KOLOM INDEX 1 (X) dan Index 2 (Y)

          X         Y
B -1.358816 -0.708278
C -0.820046  0.296856

## Subsetting DataFRame
### Akses Menggunakan BARIS
- Ketika akan mengakses BARIS Gunakan Loc atau iLoc
- ada alternatif lgsg menggunakan 1 bracket dan tanpa loc atau iloc, tetapi hanya untuk melakukan SLICING ==> df[:3] ==> akan mengakses baris paling awal hingga baris index 2
- dataFrame.loc[Nama Baris] digunakan untuk mengakses BARIS berdasarkan Nama/Label dari INDEX
- Jika baris yg diakses lebih dari 1, gunakan 2 Bracket, .loc[[Baris1, Baris2]]
- dataFrame.iloc[Nama Baris] digunakan untuk mengakses BARIS berdasarkan urutan INDEX
- Jika ada KOMA ketika akses .loc atau .iloc di dalam Bracket dimensi 1, maka informasi SEBELUM KOMA merupakan BARIS, SETELAH KOMA Merupakan KOLOM


### Akses Menggunakan KOLOM
- Gunakan dataFrame[Nama Kolom]
- Bisa menggunakan dataframe.Kolom tetapi tidak direkomendasikan, karena nama kolom tidak boleh ada spasi
- Jika kolom yg diakses lebih dari 1 , gunakan DUA Bracket ==> dataframe[[NamaKolom1, NamaKolom2]]

In [136]:
## Data Frame Manipulation

In [137]:
df

          W         X         Y         Z
A  1.049002  0.679229  1.184325  0.544070
B -0.833897 -1.358816 -0.708278 -0.349707
C -1.097763 -0.820046  0.296856  0.077821
D -0.765913  0.039293 -2.002337  0.442690
E -0.881010 -0.610049 -1.140204 -0.444052

In [139]:
## Add New Rows

In [140]:
df.loc['New'] = [1,2,3, 4] ## Jumlah data yg akan ditambahkan HARUS SAMA dengan jumlah kolom

In [141]:
df

            W         X         Y         Z
A    1.049002  0.679229  1.184325  0.544070
B   -0.833897 -1.358816 -0.708278 -0.349707
C   -1.097763 -0.820046  0.296856  0.077821
D   -0.765913  0.039293 -2.002337  0.442690
E   -0.881010 -0.610049 -1.140204 -0.444052
New  1.000000  2.000000  3.000000  4.000000

In [142]:
df.loc['New2'] = [1, 2, 3] ## Akan Error karena jumlah data yg ditambahkan tidak sama dengan jumlah Kolom

ValueError: cannot set a row with mismatched columns

In [146]:
df2

  Nama Siswa  Usia      Kota
A        Ari    25   Bandung
B       Andi    24   Jakarta
C       Mike    22  Surabaya
D      Cindy    20   Jakarta

## Add New Columns
- Ada 2 opsi ketika akan menambahkan kolom, menggunakan hanya 1 data (seluruh baris akan memiliki data yg sama)
- Data berbeda setiap baris, jumlah data harus sesuai dg jumlah baris

In [147]:
df2['uang_saku'] = 500000

In [149]:
df2

  Nama Siswa  Usia      Kota  uang_saku
A        Ari    25   Bandung     500000
B       Andi    24   Jakarta     500000
C       Mike    22  Surabaya     500000
D      Cindy    20   Jakarta     500000

In [150]:
df2['Tabungan'] = [1000000, 2000000] ## akan error, karena data hanya 2, sedangkan baris ada 4
## Jika kitya ingin memasukkan value yg berbeda, jumlah data harus sama dengan jumlah baris

ValueError: Length of values (2) does not match length of index (4)

In [151]:
df2['Tabungan'] = [12000000, 8000000, 15000000, 20000000]

In [152]:
df2

  Nama Siswa  Usia      Kota  uang_saku  Tabungan
A        Ari    25   Bandung     500000  12000000
B       Andi    24   Jakarta     500000   8000000
C       Mike    22  Surabaya     500000  15000000
D      Cindy    20   Jakarta     500000  20000000

## Pada praktiknya ketika kita akan menambahkan Kolom baru,
kita seringkali menggunakan Kolom lain agar Jumlah barisnya sama

In [154]:
df2['Jatah'] = df2['Tabungan'] * 0.03 ## Sama seperty Array, bersifat Element Wise ==> Setiap baris akan dikalikan 3%

In [155]:
df2

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah
A        Ari    25   Bandung     500000  12000000  360000.0
B       Andi    24   Jakarta     500000   8000000  240000.0
C       Mike    22  Surabaya     500000  15000000  450000.0
D      Cindy    20   Jakarta     500000  20000000  600000.0

In [156]:
df2.describe()
## Deskriptif Statistik Khusus data numerik

            Usia  uang_saku      Tabungan          Jatah
count   4.000000        4.0  4.000000e+00       4.000000
mean   22.750000   500000.0  1.375000e+07  412500.000000
std     2.217356        0.0  5.057997e+06  151739.909055
min    20.000000   500000.0  8.000000e+06  240000.000000
25%    21.500000   500000.0  1.100000e+07  330000.000000
50%    23.000000   500000.0  1.350000e+07  405000.000000
75%    24.250000   500000.0  1.625000e+07  487500.000000
max    25.000000   500000.0  2.000000e+07  600000.000000

In [ ]:
count ==> Jumlah data - baris
mean => nilai rata-rata
std => standar deviasi => seberapa jauh - menyimpang data dari nilai mean nya -> contoh nilai std dari uang_saku = 0, karena tidak ada nilai yg menyimpang dari nilai mean
min => nilai minimum
25% => Q1 => Kuartil 1 ==> Nilai median-nilai tengah antara nilai MIN dan 50% (Q2)
50% => Q2 => Kuartil 2 ==> Nilai Median ==> Nilai median/nilai tengah antara bnilai MIN dan MAX
75% => Q3 => Kuartil 3 => Nilai median antara nilai 50% dan nilai MAX
Max => Nilai Maksimum

In [158]:
df2.describe().loc[['mean', 'std']][['Tabungan', 'Jatah']]

          Tabungan          Jatah
mean  1.375000e+07  412500.000000
std   5.057997e+06  151739.909055

In [159]:
df2.describe(include='O')
## Menampilkan statistik deskriptif data Object (kategorikal) yg bukan numerik

       Nama Siswa     Kota
count           4        4
unique          4        3
top           Ari  Jakarta
freq            1        2

In [ ]:
count => Jumlah baris
unique => Jumlah data unik
top => Nilai Modus=> Nilai yg paling sering muncul
freq => Frequency berapa kali Modus muncul
## Ketika nilai modus ada beberapa data, maka yg ditampilkan data yg abrisnya paling atas (lebih dulu)

In [160]:
df2['Jatah'].mean()

412500.0

In [161]:
df2['Jatah'].sum()

1650000.0

In [163]:
df2['Jatah'].median()

405000.0

In [164]:
df2['Jatah'].std()

151739.90905493518

In [165]:
## Remove Data

In [167]:
df2.dtypes ## Menampilkan tipe data dari setiap kolom

Nama Siswa     object
Usia            int64
Kota           object
uang_saku       int64
Tabungan        int64
Jatah         float64
dtype: object

In [168]:
df2

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah
A        Ari    25   Bandung     500000  12000000  360000.0
B       Andi    24   Jakarta     500000   8000000  240000.0
C       Mike    22  Surabaya     500000  15000000  450000.0
D      Cindy    20   Jakarta     500000  20000000  600000.0

In [170]:
df2.drop('B') ## Ketika nilai axis tidak ditentukan, berarti menggunakan axis default
## axis default = 0, atau BARIS
## akan menghapus baris yg memiliki INDEX B

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah
A        Ari    25   Bandung     500000  12000000  360000.0
C       Mike    22  Surabaya     500000  15000000  450000.0
D      Cindy    20   Jakarta     500000  20000000  600000.0

In [171]:
df2.drop('D', axis=0) ## menghapus baris yg memiliki index = 'D' (axis = 0 berarti BARIS)

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah
A        Ari    25   Bandung     500000  12000000  360000.0
B       Andi    24   Jakarta     500000   8000000  240000.0
C       Mike    22  Surabaya     500000  15000000  450000.0

In [172]:
df2.drop('Jatah', axis = 1) ## akan menghapus KOLOM yg memiliki nama kolom 'Jatah'
## Menghapus kolom karena menggunakan axis = 1

  Nama Siswa  Usia      Kota  uang_saku  Tabungan
A        Ari    25   Bandung     500000  12000000
B       Andi    24   Jakarta     500000   8000000
C       Mike    22  Surabaya     500000  15000000
D      Cindy    20   Jakarta     500000  20000000

In [173]:
df2.drop(columns='Jatah')

  Nama Siswa  Usia      Kota  uang_saku  Tabungan
A        Ari    25   Bandung     500000  12000000
B       Andi    24   Jakarta     500000   8000000
C       Mike    22  Surabaya     500000  15000000
D      Cindy    20   Jakarta     500000  20000000

In [174]:
df2.drop('C')

  Nama Siswa  Usia     Kota  uang_saku  Tabungan     Jatah
A        Ari    25  Bandung     500000  12000000  360000.0
B       Andi    24  Jakarta     500000   8000000  240000.0
D      Cindy    20  Jakarta     500000  20000000  600000.0

In [175]:
df2.drop(columns=['Jatah', 'Kota']) ## menghapus beberapa data sekaligus (KOLOM) menggunakan List

  Nama Siswa  Usia  uang_saku  Tabungan
A        Ari    25     500000  12000000
B       Andi    24     500000   8000000
C       Mike    22     500000  15000000
D      Cindy    20     500000  20000000

In [177]:
df2.drop(['C', 'A']) ## menghapus beberapa data sekaligus (BARIS)

  Nama Siswa  Usia     Kota  uang_saku  Tabungan     Jatah
B       Andi    24  Jakarta     500000   8000000  240000.0
D      Cindy    20  Jakarta     500000  20000000  600000.0

In [178]:
df2

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah
A        Ari    25   Bandung     500000  12000000  360000.0
B       Andi    24   Jakarta     500000   8000000  240000.0
C       Mike    22  Surabaya     500000  15000000  450000.0
D      Cindy    20   Jakarta     500000  20000000  600000.0

## REMOVE Data
Secara Default, Ketika drop data, yg dihapus adalah BARIS atau axis = 0
- contoh : df.drop(['C', 'D'])  secara default akan menghapus baris C dan D
- Axis = 0 adalah BARIS, axis = 1 adalah KOLOMsecara default Axis bernilai 0
- Secara default Drop akan menghapus baris berdasarkan parameter Index
- Selain menggunakan parameter axis = 1, bisa juga menggunakan parameter columns jika ingin menghapus KOLOM
- Tapi, ini hanya menampilkan Output, Tidak mengubah/mengupdate Data Original

Untuk / Agar Data Original ter-update, caranya :
- Assign syntax tsb ke dalam variabel data original
- Gunakan parameter inplace=True

In [179]:
df2

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah
A        Ari    25   Bandung     500000  12000000  360000.0
B       Andi    24   Jakarta     500000   8000000  240000.0
C       Mike    22  Surabaya     500000  15000000  450000.0
D      Cindy    20   Jakarta     500000  20000000  600000.0

In [180]:
df2['Kali5'] = df2['Usia'] * 5

In [181]:
df2

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah  Kali5
A        Ari    25   Bandung     500000  12000000  360000.0    125
B       Andi    24   Jakarta     500000   8000000  240000.0    120
C       Mike    22  Surabaya     500000  15000000  450000.0    110
D      Cindy    20   Jakarta     500000  20000000  600000.0    100

In [182]:
df2.drop(columns='Kali5')

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah
A        Ari    25   Bandung     500000  12000000  360000.0
B       Andi    24   Jakarta     500000   8000000  240000.0
C       Mike    22  Surabaya     500000  15000000  450000.0
D      Cindy    20   Jakarta     500000  20000000  600000.0

In [183]:
df2

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah  Kali5
A        Ari    25   Bandung     500000  12000000  360000.0    125
B       Andi    24   Jakarta     500000   8000000  240000.0    120
C       Mike    22  Surabaya     500000  15000000  450000.0    110
D      Cindy    20   Jakarta     500000  20000000  600000.0    100

In [184]:
## Menghapus kolom Kali5 dan Update data original
## menggunakan metode Assign syntax ke data original

df2 = df2.drop(columns='Kali5')

In [185]:
df2

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah
A        Ari    25   Bandung     500000  12000000  360000.0
B       Andi    24   Jakarta     500000   8000000  240000.0
C       Mike    22  Surabaya     500000  15000000  450000.0
D      Cindy    20   Jakarta     500000  20000000  600000.0

In [186]:
## Menghapus kolom Jatah dan update data original
## menggunakan metode - parameter inplace = True

In [188]:
df2.drop(columns='Jatah')

  Nama Siswa  Usia      Kota  uang_saku  Tabungan
A        Ari    25   Bandung     500000  12000000
B       Andi    24   Jakarta     500000   8000000
C       Mike    22  Surabaya     500000  15000000
D      Cindy    20   Jakarta     500000  20000000

In [189]:
df2

  Nama Siswa  Usia      Kota  uang_saku  Tabungan     Jatah
A        Ari    25   Bandung     500000  12000000  360000.0
B       Andi    24   Jakarta     500000   8000000  240000.0
C       Mike    22  Surabaya     500000  15000000  450000.0
D      Cindy    20   Jakarta     500000  20000000  600000.0

In [190]:
df2.drop(columns='Jatah', inplace=True)

In [191]:
df2

  Nama Siswa  Usia      Kota  uang_saku  Tabungan
A        Ari    25   Bandung     500000  12000000
B       Andi    24   Jakarta     500000   8000000
C       Mike    22  Surabaya     500000  15000000
D      Cindy    20   Jakarta     500000  20000000

In [192]:
df

            W         X         Y         Z
A    1.049002  0.679229  1.184325  0.544070
B   -0.833897 -1.358816 -0.708278 -0.349707
C   -1.097763 -0.820046  0.296856  0.077821
D   -0.765913  0.039293 -2.002337  0.442690
E   -0.881010 -0.610049 -1.140204 -0.444052
New  1.000000  2.000000  3.000000  4.000000

In [193]:
## COnditional Subsetting

In [194]:
df > 0

         W      X      Y      Z
A     True   True   True   True
B    False  False  False  False
C    False  False   True   True
D    False   True  False   True
E    False  False  False  False
New   True   True   True   True

In [195]:
df[df>0] ## nilai yg sesuai dg kondisi (> 0) (TRUE) akan ditampilkan, yg bernilai FALSE tidak akan ditampilkan

            W         X         Y         Z
A    1.049002  0.679229  1.184325  0.544070
B         NaN       NaN       NaN       NaN
C         NaN       NaN  0.296856  0.077821
D         NaN  0.039293       NaN  0.442690
E         NaN       NaN       NaN       NaN
New  1.000000  2.000000  3.000000  4.000000

In [ ]:
NaN => Not a Number ==> Missing Value ==> Data Kosong

In [ ]:
Syntax Conditional subset :
    dataframe[Kondisi]

In [197]:
df

            W         X         Y         Z
A    1.049002  0.679229  1.184325  0.544070
B   -0.833897 -1.358816 -0.708278 -0.349707
C   -1.097763 -0.820046  0.296856  0.077821
D   -0.765913  0.039293 -2.002337  0.442690
E   -0.881010 -0.610049 -1.140204 -0.444052
New  1.000000  2.000000  3.000000  4.000000

In [198]:
df[df['X'] > 0] ## akan menampilkan data yg nilai kolom X nya diatas 0 (bernilai TRUE)

            W         X         Y        Z
A    1.049002  0.679229  1.184325  0.54407
D   -0.765913  0.039293 -2.002337  0.44269
New  1.000000  2.000000  3.000000  4.00000

In [200]:
df[df['X'] > 0][['X', 'Y']]

            X         Y
A    0.679229  1.184325
D    0.039293 -2.002337
New  2.000000  3.000000

In [201]:
df[df['X'] > 0][['X', 'Y']].loc[['A', 'D']]

          X         Y
A  0.679229  1.184325
D  0.039293 -2.002337

In [202]:
df[df['X'] > 0] ## nilai X diatas 0

            W         X         Y        Z
A    1.049002  0.679229  1.184325  0.54407
D   -0.765913  0.039293 -2.002337  0.44269
New  1.000000  2.000000  3.000000  4.00000

In [203]:
df[df['Y'] > 0] ## nilai Y diatas 0

            W         X         Y         Z
A    1.049002  0.679229  1.184325  0.544070
C   -1.097763 -0.820046  0.296856  0.077821
New  1.000000  2.000000  3.000000  4.000000

In [204]:
## Subset data, yg nilai X nya diatas 0 DAN nilai Y nya diatas 0

In [ ]:
df[Kondisi1, Kondisi2, Kondisi3, dst]

In [205]:
df[df['X'] > 0 & df['Y'] > 0] ## pada pandas Logika AND menggunakan simbol &

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [206]:
df[(df['X'] > 0) & (df['Y'] > 0)] ## Jika kondisi lebih dari 1, pisahkan masing-masing kondisi menggunakan tanda Kurung

            W         X         Y        Z
A    1.049002  0.679229  1.184325  0.54407
New  1.000000  2.000000  3.000000  4.00000

In [ ]:
- Gunakan Simbol & untuk Logika operator AND
- gunakan simbol | untuk logika operator OR
- Masing-masing kondisi harus dipisah dalam kurung [(Kondisi1) & (Kondisi2) or (Kondisi3)]

In [207]:
df[(df['X'] > 0) | (df['Y'] > 0)]

            W         X         Y         Z
A    1.049002  0.679229  1.184325  0.544070
C   -1.097763 -0.820046  0.296856  0.077821
D   -0.765913  0.039293 -2.002337  0.442690
New  1.000000  2.000000  3.000000  4.000000